#### StairsPathLineShapeAtCorner Enumeration

---

|  |
| --- |
| See Also |

The options for the line shape of a stairs path at a corner.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum StairsPathLineShapeAtCorner ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration StairsPathLineShapeAtCorner ``` |

| Visual C++ |
| --- |
| ``` public enum class StairsPathLineShapeAtCorner ``` |

# Members

| Member name | Description |
| --- | --- |
| Straight | The line shape of stairs path at the corner is straight. |
| Curved | The line shape of stairs path at the corner is curved. |

# See Also

Autodesk.Revit.DB.Architecture Namespace